{
    "name": "Starting",
    "kind": "story",
    "pages": [
        {
            "name": "Start",
            "music": "demo.mp3",
            "bg": "Pumpkins.jpg",
            "text": "Today’s travels bring you and a small party of your followers into a village called Coringos. There, you are to speak with the village’s leader, a priest and lord named Elder Vicus about the rebellion and see if you can win his trust. As a lord with some considerable pull in the outlying lands, you could improve your influence considerably by having him as an ally. Briony warned you however that he is highly religious and not too popular.\n\tUpon entering the town, you are greeted by the sight of five or six children playing a game. It seems they are pretending to fight a battle, using sticks as swords and spears. All of them are boys, except for one girl who is not playing with the main group but crouched in the grass, looking for a stick of her own. When she finds one, she rushes in to meet the boys in battle, but the game ceases immediately when she joins. \nThe largest of the boys speaks up, saying “Girls are of the earth, this is a battle for boys. Elder Vicus says that Venor made girls for wifeing and farming, not for fighting!”\n\tLooking dejected and with tears in her eyes, she turns to leave the boys, and spots you coming up the road. She shouts, excitedly “Real warriors!” and runs up to greet you. The boys are not far behind.\n\n{alexGender}\n\nBefore you have a chance to respond, the boy who spoke against her before interjects “That’s Tecra, Elder Vicus’s daughter. I think she’s never read the scriptures.”\n\tShe seems angry and embarrassed ‘Yes I have!” she shouts\n\tThe boy responds “She talks like she never has.”\n\tDuring all of the noise, you didn’t notice the approach of a tall, firm looking man in his fifties. He is wearing the robes of a priest, and from his stately presence, you assume that he must be Elder Vicus. He speaks “So you must be [Title] Alex. I heard you would be coming. My apologies for my daughter, she doesn’t know what she’s talking about.”\n\tTecra pulls on your shirt then and speaks up “Alex you’re a real warrior. Tell my dad that I can be one too.”\n",
            "choices": [
                [
                    "Tell Tecra that she can be whatever she wants.",
                    false,
                    [
                        [
                            "changeInfluence",
                            [
                                "Pragmatic",
                                "-=",
                                3
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Kind",
                                "+=",
                                3
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Intuitive",
                                "+=",
                                2
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Altruist",
                                "+=",
                                5
                            ]
                        ],
                        [
                            "changePage",
                            [
                                "Start[0]"
                            ]
                        ]
                    ],
                    [
                        [
                            "All",
                            [],
                            [
                                [
                                    "Morale",
                                    [
                                        "-=",
                                        3
                                    ]
                                ]
                            ]
                        ],
                        [
                            "All",
                            [
                                [
                                    "Name",
                                    [
                                        "==",
                                        "Astraea"
                                    ]
                                ]
                            ],
                            [
                                [
                                    "Loyalty",
                                    [
                                        "+=",
                                        10
                                    ]
                                ]
                            ]
                        ]
                    ]
                ],
                [
                    "Tell Tecra to listen to her father.",
                    false,
                    [
                        [
                            "changePage",
                            [
                                "Start[1]"
                            ]
                        ],
                        [
                            "setVar",
                            [
                                "Global",
                                "money",
                                "+=",
                                1000
                            ]
                        ],
                        [
                            "changeRelation",
                            [
                                "Venoriae",
                                "Stability",
                                "-=",
                                2
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Pragmatic",
                                "+=",
                                5
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Kind",
                                "-=",
                                1
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Altruist",
                                "-=",
                                5
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Egoist",
                                "+=",
                                3
                            ]
                        ],
                        [
                            "changeInfluence",
                            [
                                "Nepotist",
                                "+=",
                                1
                            ]
                        ]
                    ],
                    [
                        [
                            "All",
                            [],
                            [
                                [
                                    "Morale",
                                    [
                                        "+=",
                                        7
                                    ]
                                ]
                            ]
                        ],
                        [
                            "All",
                            [
                                [
                                    "Gender",
                                    [
                                        "==",
                                        "Female"
                                    ]
                                ]
                            ],
                            [
                                [
                                    "Loyalty",
                                    [
                                        "-=",
                                        5
                                    ]
                                ]
                            ]
                        ]
                    ]
                ],
                [
                    "Ignore Tecra and ask Vicus to speak somewhere private.",
                    false,
                    [
                        [
                            "changePage",
                            [
                                "Start[2]"
                            ]
                        ]
                    ],
                    []
                ],
                [
                    "Confront Vicus about the sexist rhetoric that he’s been teaching the town’s children.",
                    false,
                    [
                        [
                            "changePage",
                            [
                                "Start[3]"
                            ]
                        ]
                    ],
                    []
                ]
            ],
            "onload": [
                [
                    "All",
                    [],
                    []
                ]
            ],
            "modules": [
                [
                    "alexGender",
                    "The children crowd around and ask questions about your weapons and the battles you’ve fought. All throughout, the girl seems to have taken a step back to give the boys space, but as they quieten down a little, she speaks up “Do you know any girl warriors?”",
                    [
                        [
                            "All",
                            "As the children crowd around, the girl points emphatically at you and yells “Look, a girl warrior! I knew the scriptures were wrong!”",
                            [
                                [
                                    "checkCharProp",
                                    [
                                        "Alex",
                                        "Gender",
                                        "==",
                                        "Female"
                                    ]
                                ]
                            ]
                        ]
                    ]
                ]
            ]
        },
        {
            "name": "Start[0]",
            "music": "demo.mp3",
            "bg": "Pumpkins.jpg",
            "text": "Tecra beams at your response, and you get the impression that this is something she will remember for the rest of her life. Vicus frowns and says “Let’s get this over with.” You are invited into his abode to discuss the political situation of the country. He seems unconvinced that you are worth supporting. He refuses to support you publicly, but you don’t imagine he will denounce you either.",
            "choices": [],
            "onload": [],
            "modules": []
        },
        {
            "name": "Start[1]",
            "music": "demo.mp3",
            "bg": "Pumpkins.jpg",
            "text": "Tecra steps back and lowers her eyes to the ground. Elder Vicus seems pleased that you supported him. The two of you step inside his abode and discuss the political situation in the country. Throughout the meeting, he explains that Tecra has ‘a lot to learn’ and ‘will be punished’. You can’t help but feel that you encouraged him to be even more controlling. Still, at the end of the meeting, he agrees to support you publicly, and offers to help fund the rebellion. When all is said and done, [FEMALE NPC] scowls at you and says bitterly “Flattering his ego isn’t doing us any favours.”",
            "choices": [],
            "onload": [],
            "modules": []
        },
        {
            "name": "Start[2]",
            "music": "demo.mp3",
            "bg": "Pumpkins.jpg",
            "text": "Avoiding the awkward situation with the children, you and Elder Vicus step inside his abode and discuss the political situation in the country. Although the meeting goes well, and Vicus agrees to support you publicly, you find that some of the followers who accompanied you seem upset about your avoidance of the question.",
            "choices": [],
            "onload": [],
            "modules": []
        },
        {
            "name": "Start[3]",
            "music": "demo.mp3",
            "bg": "Pumpkins.jpg",
            "text": "After that comment the conversation turns sour pretty quickly. Before long you and Elder Vicus are parting ways bitterly. It’s obvious that he won’t support your rebellion and will likely speak out against it.",
            "choices": [],
            "onload": [],
            "modules": []
        }
    ],
    "vrs": {}
}